package com.work406.newclass;
/**
 * 
 * 主题：抽象类
 * 1.什么是抽象类
 * 		当我们进行父类抽取时的时候，遇到方法具体实现的时候，每个子类实现方法都不一样，
 * 		那么这个时候，我们应该把这个方法定义成抽象方法。
 * 		ps:有抽象方法的类一定是个抽象类
 * 
 * 2.抽象类和抽象方法的定义
 * 		关键字:abstract
 *		final和abstract不能共存
 *
 * 3.抽象类成员的特点:
 * 		成员变量：既可以有变量也可以有常量
 * 		成员方法：既可以有抽象方法，也可以有非抽象方法
 * 		构造方法：可以有构造方法
 * 
 * 4.抽象类的注意事项
 * 		抽象类不能创建对象使用
 * 		子类继承父类时，如果未重写父类的抽象方法，那么子类默认为抽象类
 *	
 */
public class Demo_02 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
